## Plan Result (sbox-managed-identity)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.service_operator[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.service_operator[0] will be created
  + resource "azurerm_role_assignment" "service_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ff47ab8f-e4d9-48f2-ad31-af5933824849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":424,"Program":"tfcmt","SHA1":"","Target":"sbox-managed-identity","Vars":{}} -->